app/controllers/songs_controller.rb

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "songs".* FROM "songs" WHERE "songs"."artist_id" = ? AND "songs"."id" = ? LIMIT ?  [["artist_id", 2], ["id", 1], ["LIMIT", 1]]
---
  def show
    if params[:artist_id].present?
      @song = Artist.find(params[:artist_id]).songs[params[:id].to_i]